# Import Libraries

In [1]:
import pandas as pd

**Panda** has two main data structures it uses, namely, **series**, **DataFrames**.
## Series 
**-**one dimentional labeled array

In [2]:
ser = pd.Series(data = [34,35,36,37], index = ['Mouni','Raita','Zawwad','Usha'])

In [3]:
ser

Mouni     34
Raita     35
Zawwad    36
Usha      37
dtype: int64

In [4]:
ser.index

Index(['Mouni', 'Raita', 'Zawwad', 'Usha'], dtype='object')

In [5]:
ser['Mouni']

34

In [6]:
print('One index : ',ser.loc['Raita'])

print('\nMultiple index :\n',ser.loc[['Raita','Zawwad']])

One index :  35

Multiple index :
 Raita     35
Zawwad    36
dtype: int64

In [7]:
ser[[3,2,1]]  # Double 3rd bracket

Usha      37
Zawwad    36
Raita     35
dtype: int64

In [8]:
'Rifat' in ser

False

In [9]:
'Raita' in ser

True

In [10]:
ser*2

Mouni     68
Raita     70
Zawwad    72
Usha      74
dtype: int64

In [11]:
ser**2

Mouni     1156
Raita     1225
Zawwad    1296
Usha      1369
dtype: int64

## DataFrame
**-** two dimentional labeled array.

**Create DataFrame** from **dictionary**

In [12]:
d = {'One': pd.Series([1,2,3,4], index = [ 'Raghib', 'Pipe', 'Bagha', 'Sakin']),
    'Two': pd.Series([3.1,2.8,3.49,3.3], index = ['Bagha', 'Sakin', 'Zerin', 'Imran'])}

In [13]:
df = pd.DataFrame(d)

print(df)

print('\nIndexes are : ', df.index)

print('\nColumns are : ',df.columns)

        One   Two
Bagha   3.0  3.10
Imran   NaN  3.30
Pipe    2.0   NaN
Raghib  1.0   NaN
Sakin   4.0  2.80
Zerin   NaN  3.49

Indexes are :  Index(['Bagha', 'Imran', 'Pipe', 'Raghib', 'Sakin', 'Zerin'], dtype='object')

Columns are :  Index(['One', 'Two'], dtype='object')

In [14]:
print(pd.DataFrame(d, index = ['Raghib', 'Bagha', 'Sakin']))

        One  Two
Raghib    1  NaN
Bagha     3  3.1
Sakin     4  2.8

In [15]:
# If we asking for a column from Dictionary.
print('Printing 1st column : \n\n',pd.DataFrame(d, columns = ['One']))

print('\nPrinting 1st two column : \n\n',pd.DataFrame(d, columns = ['One','Two']))

print('\nPrinting 2nd and 3rd column : \n\n',pd.DataFrame(d, columns = ['Two','Three']))

Printing 1st column :

         One
Raghib    1
Pipe      2
Bagha     3
Sakin     4

Printing 1st two column :

         One   Two
Bagha   3.0  3.10
Imran   NaN  3.30
Pipe    2.0   NaN
Raghib  1.0   NaN
Sakin   4.0  2.80
Zerin   NaN  3.49

Printing 2nd and 3rd column :

         Two Three
Bagha  3.10   NaN
Sakin  2.80   NaN
Zerin  3.49   NaN
Imran  3.30   NaN

In [16]:
# We can create DataFrame from list of Python Dictionary

import pandas as pd

data = [{'a':1, 'b':2, 'c':3},{'d':3,'e':5,'f':6}]

In [17]:
pd.DataFrame(data)

## Here the row label is 0 and 1. Because we didn't provide any index label.

     a    b    c    d    e    f
0  1.0  2.0  3.0  NaN  NaN  NaN
1  NaN  NaN  NaN  3.0  5.0  6.0

In [18]:
# We can provide an index lable.

pd.DataFrame(data, index = ['sky', 'pink'])

        a    b    c    d    e    f
sky   1.0  2.0  3.0  NaN  NaN  NaN
pink  NaN  NaN  NaN  3.0  5.0  6.0

In [19]:
# We can select some of the elements from dictionary as columns

pd.DataFrame(data, columns = ['c','d'])

     c    d
0  3.0  NaN
1  NaN  3.0

# Basic DataFrame operation

In [20]:
df

        One   Two
Bagha   3.0  3.10
Imran   NaN  3.30
Pipe    2.0   NaN
Raghib  1.0   NaN
Sakin   4.0  2.80
Zerin   NaN  3.49

In [21]:
df['One']

Bagha     3.0
Imran     NaN
Pipe      2.0
Raghib    1.0
Sakin     4.0
Zerin     NaN
Name: One, dtype: float64

In [22]:
# Using these columns we can create a new column

df['Three'] = df['One']*df['Two']

In [23]:
df

        One   Two  Three
Bagha   3.0  3.10    9.3
Imran   NaN  3.30    NaN
Pipe    2.0   NaN    NaN
Raghib  1.0   NaN    NaN
Sakin   4.0  2.80   11.2
Zerin   NaN  3.49    NaN

In [24]:
# Logical Operation
df['flag'] = df['Two']>3.2

In [25]:
df

        One   Two  Three   flag
Bagha   3.0  3.10    9.3  False
Imran   NaN  3.30    NaN   True
Pipe    2.0   NaN    NaN  False
Raghib  1.0   NaN    NaN  False
Sakin   4.0  2.80   11.2  False
Zerin   NaN  3.49    NaN   True

In [26]:
#Delete a column

df.pop('Three')    # pop we use ()

Bagha      9.3
Imran      NaN
Pipe       NaN
Raghib     NaN
Sakin     11.2
Zerin      NaN
Name: Three, dtype: float64

In [27]:
df

        One   Two   flag
Bagha   3.0  3.10  False
Imran   NaN  3.30   True
Pipe    2.0   NaN  False
Raghib  1.0   NaN  False
Sakin   4.0  2.80  False
Zerin   NaN  3.49   True

In [28]:
#del function to delete a column

del df['Two']  # del we use []

In [29]:
df

        One   flag
Bagha   3.0  False
Imran   NaN   True
Pipe    2.0  False
Raghib  1.0  False
Sakin   4.0  False
Zerin   NaN   True

In [30]:
df.insert(2, 'copy of one',df['One'])

In [31]:
df

        One   flag  copy of one
Bagha   3.0  False          3.0
Imran   NaN   True          NaN
Pipe    2.0  False          2.0
Raghib  1.0  False          1.0
Sakin   4.0  False          4.0
Zerin   NaN   True          NaN

In [32]:
df.insert(1, 'copy of flag',df['flag'])

In [33]:
df

        One  copy of flag   flag  copy of one
Bagha   3.0         False  False          3.0
Imran   NaN          True   True          NaN
Pipe    2.0         False  False          2.0
Raghib  1.0         False  False          1.0
Sakin   4.0         False  False          4.0
Zerin   NaN          True   True          NaN

In [34]:
df['One upper half'] = df['One'][:2]

In [35]:
df

        One  copy of flag   flag  copy of one  One upper half
Bagha   3.0         False  False          3.0             3.0
Imran   NaN          True   True          NaN             NaN
Pipe    2.0         False  False          2.0             NaN
Raghib  1.0         False  False          1.0             NaN
Sakin   4.0         False  False          4.0             NaN
Zerin   NaN          True   True          NaN             NaN

In [36]:
df.insert(4, 'copy of one upper half',df['One upper half'])

In [37]:
df

,One,copy of flag,flag,copy of one,copy of one upper half,One upper half
Bagha,3.0,False,False,3.0,3.0,3.0
Imran,NaN,True,True,NaN,NaN,NaN
Pipe,2.0,False,False,2.0,NaN,NaN
Raghib,1.0,False,False,1.0,NaN,NaN
Sakin,4.0,False,False,4.0,NaN,NaN
Zerin,NaN,True,True,NaN,NaN,NaN